import random
#пишемо групи слів пишемо з Великої букви :)
перші_слова = ["Розумний", "Креативний", "Прагнучий", "Прагнучий", "Прагнучий"]

другі_слова = ["програміст", "інженер", "дизайнер", "архітектор", "розробник"]

треті_слова = ["своє майбутне", "змінює світ", "вирішеу проблеми", "впроваджуе іновації"]

def генерувати_фразу():
    
    перше_слово = random.choice(перші_слова)
    друге_слово = random.choice(другі_слова)
    третє_слово = random.choice(треті_слова)
    
    return f"{перше_слово} {друге_слово} {третє_слово}"

#генеруємо 5 випадеових фраз

print ("ось 5 випадково згенерованих фраз: ")
for i in range(5):
    print (f"{i+1}. {генерувати_фразу()}")
